package main

import (
	"encoding/json"
	"fmt"
)

var FormatConfig struct {
	Video            map[string]*ValFormat        `json:"video,omitempty"`
	Article          map[string]*ValFormat        `json:"article,omitempty"`
	MachineFilterMap map[string]string            `json:"machine_filter_map,omitempty"` //机器审原因
	Person1FilterMap map[string]map[string]string `json:"person1_filter_map,omitempty"` //人工初审原因
	Person2FilterMap map[string]map[string]string `json:"person2_filter_map,omitempty"` //人工复审原因
	DelDetailMap     map[string]string            `json:"del_detail_map,omitempty"`     //下架原因
}

type ValFormat struct {
	Type      string   `json:"type,omitempty"`       // 类型
	Format    string   `json:"format,omitempty"`     // 格式化
	HbaseKeys []string `json:"hbase_keys,omitempty"` // 对应hbase字段
}

func reParseConf(oriDecodeConf interface{}, dstDecodeConf interface{}) (err error) {
	confJson, _ := json.Marshal(oriDecodeConf)
	err = json.Unmarshal(confJson, dstDecodeConf)
	if err != nil {
		fmt.Printf("\"%s\" parse err: %s\n", confJson, err.Error())
	}
	return
}

// reParseTest, 蛋疼的场景中需要把json解析到的map[string]string转化成struct
func reParseTest(){
	jsonData := []byte(`{"article":{"input_ts":{"type":"time","format":"2006-01-02 15:04:05"},"ex_id":{"key":"cmsid"},"format_filter_desc":{"type":"func","format":"setFilterReason"}},"video":{"input_ts":{"type":"time","format":"2006-01-02 15:04:05"},"kb_id":{"key":"cmsid"},"format_filter_desc":{"type":"func","format":"setFilterReason"}},"del_detail_map":{"3":"","5":"","7":"","9":"","12":"","19":"","21":"","23":"","25":"【内容中心】【下架】与平台已有内容重复","26":"【内容中心】【下架】与平台已有内容重复","29":"","32":"","34":"","37":"","39":"【内容中心】【下架】文章内容不符合规范","41":"【内容中心】【下架】内容不符合规范","42":"","43":"","44":"","45":"","46":"【内容中心】【下架】内容不符合规范","47":"","48":"","49":"【内容中心】【下架】内容不符合规范","52":"【内容中心】【下架】账号判定为低质账号","53":"【内容中心】【下架】账号判定为低质账号","54":"【内容中心】【下架】内容不符合规范","77":"【内容中心】【下架】与平台已有内容重复","99":""},"machine_filter_map":{"1":"文章信息缺失","3":"文章内容不符合规范","4":"文章内容不符合规范","5":"文章信息缺失","6":"与平台已有内容重复","9":"其他原因","10":"与平台已有内容重复","11":"其他原因","12":"文章内容不符合规范","13":"其他原因","14":"文章内容不符合规范","16":"与平台已有内容重复（所发为过期新闻）","17":"文章内容不符合规范","18":"封面图不符合规范","19":"封面图缺失","20":"与平台已有内容重复","21":"文章含有广告导流信息","22":"账号判定为低质账号","23":"账号判定为低质账号","24":"账号判定为低质账号","25":"账号判定为低质账号","26":"账号判定为低质账号","27":"账号判定为低质账号","28":"账号判定为低质账号","29":"账号判定为低质账号","30":"账号判定为低质账号","31":"账号判定为低质账号","32":"账号判定为低质账号","33":"账号判定为低质账号","34":"账号判定为低质账号","35":"账号判定为低质账号","36":"文章内容不符合规范","38":"其他原因","39":"标题不符合规范","40":"标题不符合规范","41":"其他原因","42":"文章内容不符合规范","46":"文章内容不符合规范","48":"文章内容不符合规范","49":"文章图片排版不符合规范","50":"文章含有广告导流信息","51":"文章含有广告导流信息","52":"文章含有广告导流信息","53":"文章中含有不合规敏感词","54":"文章内容不符合规范","58":"标题不符合规范","61":"文章中含有不合规敏感词","62":"文章内容不符合规范","63":"账号判定为低质账号","64":"账号判定为低质账号","65":"（文章内容不符合规范）","67":"文章过期，建议整理后重新发布","68":"文章内容不符合规范","69":"标题不符合规范","70":"标题不符合规范","71":"标题不符合规范","72":"标题不符合规范","74":"内容分类不符合规范","75":"内容已删除","78":"文章内容不符合规范","79":"账号判定为低质账号","80":"账号判定为低质账号","81":"标题不符合规范","82":"文章内容不符合规范","83":"（文章内容不符合规范）","84":"（文章内容不符合规范）","85":"与平台已有内容重复","86":"与平台已有内容重复","90":"其他原因","91":"文章内容不符合规范","92":"文章内容不符合规范","101":"标题不符合规范","103":"内容信息缺失","104":"内容信息缺失","105":"内容信息缺失","106":"低质账号拦截","107":"内容信息缺失","108":"其他原因","109":"其他原因","114":"其他原因","116":"文章内容不符合规范","117":"文章内容不符合规范","118":"文章内容不符合规范","131":"与平台已有内容重复","132":"与平台已有内容重复","133":"与平台已有内容重复","134":"与平台已有内容重复","135":"与平台已有内容重复","136":"与平台已有内容重复","137":"与平台已有内容重复","138":"与平台已有内容重复","139":"与平台已有内容重复","150":"其他原因","301":"账号判定为低质账号","303":"视频内容不符合规范","311":"标题不符合规范","10014":"图集图片过少拦截","10015":"账号判定为低质账号","10017":"账号判定为低质账号","10020":"账号判定为低质账号","10021":"标题不符合规范","10022":"账号判定为低质账号","10024":"标题不符合规范","10025":"标题不符合规范","20001":"内容信息缺失","20002":"内容信息缺失","20003":"内容信息缺失","20004":"内容信息缺失","20005":"内容信息缺失","20006":"其他原因","20007":"其他原因","20008":"视频内容不符合规范","20009":"其他原因","20010":"其他原因","20011":"疑似抖音内容拦截","20012":"不可分发","20013":"不可分发","20014":"账号判定为低质账号","20015":"账号判定状态异常","20016":"疑似抖音内容拦截","20017":"视频已删除","20018":"上游未审核","20019":"内容信息缺失","20020":"内容信息缺失","20021":"内容信息缺失","20022":"内容信息缺失","20023":"内容信息缺失","20024":"视频内容不符合规范","20025":"视频已删除","20026":"其他原因","20027":"内容信息缺失","20028":"其他原因","20029":"与平台已有内容重复","20030":"其他原因","20031":"其他原因","20032":"其他原因","20033":"其他原因","20034":"其他原因","20035":"视频时长小于4s","20036":"账号判定为低质账号","20037":"标题不符合规范","20038":"标题不符合规范"},"person1_filter_map":{"0":{"涉及色情":"文章内容低俗色情","广告软文":"文章含有广告导流信息","涉及侵权":"文章内含有涉及侵权内容","谣言内容":"文章内容不符合规范","涉及暴力内容":"文章内容低俗暴力","政治敏感":"内容分类不符合规范","违规倒流":"文章含有广告导流信息","标题党":"标题不符合规范","内容无营养":"文章内容无意义","内容已删除":"内容已删除","含有发文无关内容":"文章内容情节不完整","宣发广告文":"文章含有广告导流信息（行政公文）","错别字":"文章内容含有错别字","内容不完整":"文章内容情节不完整","旧闻重复":"与平台已有内容重复（所发为过期新闻）"},"1":{"安全问题":"视频内容涉及低俗色情暴力等","广告营销引流logo水印":"视频含有广告导流信息","视频体验问题":"视频清晰度等不符合规范","封面质量问题":"封面模糊","标题质量问题":"标题不符合规范","视频长短":"视频时长不符合要求","内容问题":"视频内容平台已存在（过期新闻）","封面":"封面和内容不符","标题":"标题不符合规范","低质解说":"视频内容无意义","启用时去重拦截":"与平台已有内容重复"}},"person2_filter_map":{"27":{"涉及色情":"文章内容低俗色情","广告软文":"文章含有广告导流信息","涉及侵权":"文章内含有涉及侵权内容","谣言内容":"文章内容不符合规范","涉及暴力内容":"文章内容低俗暴力","政治敏感":"内容分类不符合规范","违规倒流":"文章含有广告导流信息","标题党":"标题不符合规范","内容无营养":"文章内容无意义","内容已删除":"内容已删除","含有发文无关内容":"文章内容情节不完整","宣发广告文":"文章含有广告导流信息（行政公文）","错别字":"文章内容含有错别字","内容不完整":"文章内容情节不完整","旧闻重复":"与平台已有内容重复（所发为过期新闻）"},"38":{"安全问题":"视频内容涉及低俗色情暴力等","广告营销引流logo水印":"视频含有广告导流信息","视频体验问题":"视频清晰度等不符合规范","封面质量问题":"封面模糊","标题质量问题":"标题不符合规范","视频长短":"视频时长不符合要求","内容问题":"视频内容平台已存在（过期新闻）","封面":"封面和内容不符","标题":"标题不符合规范","低质解说":"视频内容无意义","启用时去重拦截":"与平台已有内容重复"}}}`)
	unmarshalData := map[string]interface{}{}
	_ = json.Unmarshal(jsonData, &unmarshalData)
	//fmt.Println(unmarshalData)
	_ = reParseConf(unmarshalData["video"], &FormatConfig.Video)
	_ = reParseConf(unmarshalData["article"], &FormatConfig.Article)
	_ = reParseConf(unmarshalData["del_detail_map"], &FormatConfig.DelDetailMap)
	_ = reParseConf(unmarshalData["machine_filter_map"], &FormatConfig.MachineFilterMap)
	_ = reParseConf(unmarshalData["person1_filter_map"], &FormatConfig.Person1FilterMap)
	_ = reParseConf(unmarshalData["person2_filter_map"], &FormatConfig.Person2FilterMap)
	fmt.Printf("format_config: %v\n", FormatConfig)

}

func main() {
	reParseTest()
}
